Обработки/Reports/_ОтчетОДоходахИРасходахДоверие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахДоверие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахДоверие/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах и расходах (Доверие)",
		"0.15",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

//Внимание! По требование клиента из отчета убраны доходы и расходы по погашению НКД
// В макете "настройка" этим статьям устанвлен знак 0.
// сделано так, чтобы они не попадали в прочее. 
Процедура Сформировать(ДокументРезультат, ДокументРасшифровка) Экспорт 
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");	
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;		
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	
	МакетНастройка = ПолучитьМакет("Настройка");
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
		
	Если ТаблицаНастройки.Количество() = 0 Тогда
		
		Сообщить("Отсутствует настройка для отчета");
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
		Возврат;
		
	КонецЕсли;	
	
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "ЯчейкаПрочиеДоходы", "ЯчейкаПрочиеРасходы", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);
	
	//вывод формы
	Отчет = ПолучитьМакет("Отчет");
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	//ОбластьОтчет.Параметры.ДатаОтчета				= Формат(ПараметрыШапки.ДатаОтчета, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	//показатели
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 	
	ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеДоходы", ОбластьОтчет, Отчет, ПрочиеДоходы);
	ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеРасходы", ОбластьОтчет, Отчет, ПрочиеРасходы);	
	
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	//Подписи	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "ОтчетОДоходахИРасходахДоверие", , ОриентацияСтраницы.Портрет);		
	
	//Расшифровка
	ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, ТабРасшифровки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры	

Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка");	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	

	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройки, Параметры);
		
КонецПроцедуры
